app/controllers/passwords_controller.rb

  def show
    @password = current_user.passwords.find(params[:id])
---
SELECT "passwords".* FROM "passwords" WHERE "passwords"."user_id" = $1 AND "passwords"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 12], ["LIMIT", 1]]

  def create
    @password = current_user.passwords.new(password_params)

    respond_to do |format|
      if @password.save
---
INSERT INTO "passwords" ("url", "username", "password", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["url", "http://hh@dd"], ["username", "ali"], ["password", "[FILTERED]"], ["user_id", 1], ["created_at", "2023-12-12 13:03:16.118198"], ["updated_at", "2023-12-12 13:03:16.118198"]]

  def update
    respond_to do |format|
      if @password.update(password_params)
---
UPDATE "passwords" SET "url" = $1, "username" = $2, "updated_at" = $3 WHERE "passwords"."id" = $4  [["url", "facebook.comq"], ["username", "adminqq"], ["updated_at", "2023-12-12 14:05:54.151674"], ["id", 12]]

  def destroy
    @password.destroy
---
DELETE FROM "passwords" WHERE "passwords"."id" = $1  [["id", 14]]

  def set_password
    @password = current_user.passwords.find(params[:id])
---
SELECT "passwords".* FROM "passwords" WHERE "passwords"."user_id" = $1 AND "passwords"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 12], ["LIMIT", 1]]